app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "5"]]
---
  def destroy
  	@auction = Auction.find(params[:id])