app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."category" = 'appliances'
---
  def index
    if params[:q] || params[:auction_owner] || params[:category]
      @auctions = Auction.filter(params[:q], params[:auction_owner], params[:category]).all

INSERT INTO "auctions" ("active", "brand", "buy_now_price", "category", "color", "condition", "created_at", "description", "image", "lowest_accepted_price", "percent_off", "quantity", "size", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @auction = Auction.new(params[:auction])

    respond_to do |format|
      if @auction.save

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @auction = Auction.find(params[:id])

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
  	@auction = Auction.find(params[:id])

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "auctions" SET "image" = '', "title" = '', "brand" = '', "percent_off" = 30, "updated_at" = '2012-10-24 15:51:40.784686' WHERE "auctions"."id" = 4
---
  def update
  	@auction = Auction.find(params[:id])

  	respond_to do |format|
  		if @auction.update_attributes(params[:auction])