app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = 4
---
  def index
    if current_user.role == "admin"
      @bids = Bid.all
    else
      @bids = Bid.where(:user_id => current_user.id)