app/controllers/product_searches_controller.rb

  def create
    @product_search = ProductSearch.new(params[:product_search])

    keywords = @product_search.keywords
    @results = @product_search.show_images(keywords)

    @auction = Auction.new

    respond_to do |format|
      if @product_search.save
---
INSERT INTO "product_searches" ("created_at", "keywords", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 23 Oct 2012 15:45:32 UTC +00:00], ["keywords", "hanes sweatpants"], ["updated_at", Tue, 23 Oct 2012 15:45:32 UTC +00:00]]